tutorials/compressible/rhoSimpleFoam/squareBend/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1000;

boundaryField
{
    Default_Boundary_Region
    {
        type            zeroGradient;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 1000;
    }

    outlet
    {
        type            inletOutlet;
        //type            zeroGradient;
        value           uniform 1000;
        inletValue      uniform 1000;
    }
}

// ************************************************************************* //
